/*! \file  dac.c
* \b 接口说明：
*       KEY_S1->PA0 KEY_S2->PA1
*
* \b 功能描述:
*
*       按键扫描
*
* \b 历史记录:
*
*     <作者>        <时间>      <修改记录> <br>
*     zuokongxiao  2013-03-10   创建文件   <br>
*/

/******************************************************************************/
/*                             头文件                                         */
/******************************************************************************/
#include "stm32f10x_gpio.h"
#include "myGPIOType.h"
#include "key.h"


/******************************************************************************/
/*                             宏定义                                         */
/******************************************************************************/
/*! 按键端口 */
#define KEY_S1_PIN              PA0IN
#define KEY_S2_PIN              PA1IN

/******************************************************************************/
/*                            变量定义                                        */
/******************************************************************************/


/******************************************************************************/
/*                          内部接口声明                                      */
/******************************************************************************/




/******************************************************************************/
/*                          内部接口实现                                      */
/******************************************************************************/




/******************************************************************************/
/*                          外部接口实现                                      */
/******************************************************************************/
/*! \fn       void key_port_init(void)
*
*  \brief     按键端口初始化
*
*  \param     无
*
*  \exception 无
*
*  \return    无
*/
void key_port_init(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;

    /*! PA0 PA1 (LED)上拉输入 */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
}

/*! \fn       uint8_t key_read(void)
*
*  \brief     读按键
*
*  \param     无
*
*  \exception 无
*
*  \return    按键值
*/
uint8_t key_read(void)
{
    uint8_t ucKeyValue = KEY_NONE;
    
    if(0 == KEY_S1_PIN)
    {
        ucKeyValue |= KEY_S1;
    }
    
    if(0 == KEY_S2_PIN)
    {
        ucKeyValue |= KEY_S2;
    }
    
    return ucKeyValue;
}

/********************************end of file***********************************/

