/*! \file  uart.h
* \b 接口说明：
*       
*
* \b 功能描述:
*
*       串口驱动
*
* \b 历史记录:
*
*     <作者>        <时间>      <修改记录> <br>
*     zuokongxiao  2013-03-10   创建文件   <br>
*/
#ifndef __UART_H
#define __UART_H

/******************************************************************************/
/*                             头文件                                         */
/******************************************************************************/


/******************************************************************************/
/*                             宏定义                                         */
/******************************************************************************/
/*! 串口1发送缓冲区大小 */
#define UART1_TX_BUF_SIZE               256u
/*! 串口1发送DMA缓冲区大小 */
#define UART1_TX_DMA_BUF_SIZE           32u
/*! 串口1接收缓冲区大小 */
#define UART1_RX_BUF_SIZE               256u

/******************************************************************************/
/*                          外部接口函数声明                                  */
/******************************************************************************/
void uart_init(void);
int32_t uart_send(uint8_t *pucBufPtr, uint16_t unSendLen);
uint8_t *get_uart_rx_buf(void);
uint16_t *get_uart_rx_buf_read_index(void);
uint16_t *get_uart_rx_buf_write_index(void);
void uart_test(void);


#endif /*!< end __UART_H */

/********************************end of file***********************************/

