/*! \file  protocolio.h
* \b 接口说明：
*       
*
* \b 功能描述:
*
*       协议输入输出接口
*
* \b 历史记录:
*
*     <作者>        <时间>      <修改记录> <br>
*     zuokongxiao  2013-03-13   创建文件   <br>
*/

#ifndef __PROTOCOLIO_H
#define __PROTOCOLIO_H

/******************************************************************************/
/*                            头文件                                          */
/******************************************************************************/

/******************************************************************************/
/*                           宏定义                                           */
/******************************************************************************/
/*! 接收缓冲区长度 */
#define RECEIVE_BUF_SIZE           (UART1_RX_BUF_SIZE)


/******************************************************************************/
/*                          外部接口函数声明                                  */
/******************************************************************************/
uint16* get_receive_buf_read_index(void);
uint16* get_receive_buf_write_index(void);
uint8* get_receive_buf(void);
int32 send_return_data(uint8 *pucBuffer, uint16 unLength);


#endif /*!< end __PROTOCOLIO_H */

/********************************end of file***********************************/

