/*! \file  can.h
* \b 接口说明：
*       
*
* \b 功能描述:
*
*       stm32f103 CAN总线驱动
*
* \b 历史记录:
*
*     <作者>        <时间>      <修改记录> <br>
*     zuokongxiao  2013-03-21   创建文件   <br>
*/

#ifndef __CAN_H
#define __CAN_H

/******************************************************************************/
/*                            头文件                                          */
/******************************************************************************/


/******************************************************************************/
/*                           宏定义                                           */
/******************************************************************************/
/*! CAN1发送缓冲区长度 */
#define CAN1_TX_BUF_SIZE        512u
/*! CAN1接收缓冲区长度 */
#define CAN1_RX_BUF_SIZE        512u

/******************************************************************************/
/*                          外部接口函数声明                                  */
/******************************************************************************/
void can_init(void);
int32_t can_send(uint8_t *pucSendBuf, uint16_t unSendLen);
uint8_t *get_can_rx_buf(void);
uint16_t *get_can_rx_buf_read_index(void);
uint16_t *get_can_rx_buf_write_index(void);

int32 print_can_frame(void);

#endif /*!< end __CAN_H */

/********************************end of file***********************************/

