/*! \file  errtable.h
* \b 接口说明：
*       
*
* \b 功能描述:
*
*       错误码
*
* \b 历史记录:
*
*     <作者>        <时间>      <修改记录> <br>
*     zuokongxiao  2013-03-13   创建文件   <br>
*/

#ifndef __ERRTABLE_H
#define __ERRTABLE_H

/******************************************************************************/
/*                            头文件                                          */
/******************************************************************************/


/******************************************************************************/
/*                           宏定义                                           */
/******************************************************************************/
/*! 错误码 */
typedef enum _err_id
{
    NO_ERR = 0x0000, /*!< 无错 */
    ERR_DB_BUG = 0x0010, /*!< 驱动板BUG */
    
    ERR_DB_CMD_FORMAT_START = 0x0020, /*!< 帧起始码错误 */
    ERR_DB_CMD_FORMAT_CONTROL, /*!< 帧控制码码错误 */
    ERR_DB_CMD_FORMAT_DATALEN, /*!< 帧长度错误 */
    ERR_DB_CMD_FORMAT_CHECKSUM, /*!< 帧校验和错误 */
    ERR_DB_CMD_FORMAT_STOP, /*!< 帧停止码错误 */
    
    ERR_DB_CMD_INVALID, /*!< 无效命令 */

    /*! 阀 */
    ERR_DB_CONTROL_VALVE = 0x1000,

    /*! 泵 */
    ERR_DB_CONTROL_PUMP = 0x1100,

    /*! 采样注射器 0x2000 */
    ERR_DB_SAMPLE_SYRING = 0x2000,

    /*! 样本注入注射器 0x2100 */

    /*! 溶血剂注射器 0x2200 */

    /*! 稀释液注射器 0x2300 */

    /*! 鞘液注射器 0x2400 */

    /*! 水平电机 0x3000 */
    ERR_DB_HMOTOR_EXEC_TIME_OUT = 0x3000, /*!< 水平电机执行超时 */

    /*! 垂直电机 0x3100 */
    ERR_DB_VMOTOR_EXEC_TIME_OUT = 0x3100, /*!< 垂直电机执行超时 */

    /*! 采样组件 0x3200 */
    ERR_DB_SAMPLE_SWING_TIMEOUT = 0x3200, /*!< 采样组件水平摆动超时 */

} err_id_e;

/******************************************************************************/
/*                          外部接口函数声明                                  */
/******************************************************************************/

#endif /*!< end __ERRTABLE_H */

/********************************end of file***********************************/

